var mill = 5184020 // наше значение в миллисек. (накопленные)

// т.к. всё что больше 1000 это уже минуты, то нам нужен остаток от деления на 1000, например,
// если мы накопили 1222 миллисек., то в таймер нужно вывести 1222%1000 = 222 миллисек
var milliseconds = mill % 1000; // это готово для вывода на экран

// получаем часы
// для этого нам сначала нужно получить сколько  часов, если в одной секунде 1000 миллисек, то в одной минуте
// 1000 * 60 миллисек, в одном часе 1000 * 60 * 60
// получается часы = целое число от деления накопленных милликсек на кол-во миллисек в одном часе
var hours = Math.floor(mill/(1000 * 60 * 60)); // получили кол-во часов. Matrh.floor() - даёт нижнее целое от деления, т.е. если результат 3.56556 она вернёт 3
// в нашем примере целое при делении 5184020 на один час в миллисек (1000 * 60 * 60) Это 1, это и есть искомые часы

// далее нужно получить оставшиееся миллесекунды, за вычетом высчитанных часов, чтобы получить минуты.
var temp = mill % (1000 * 60 * 60); // % - даёт остаток от деления первого на второе,
// в одном часе у нас 3 600 000 миллисек.. т.е. если у нас значение 5 184 020, то в строке выше в temp у нас запишется 1 584 020
// из которых мы уже далее будем вычислять минуты.

// в одной минуте у нас 1000*60 миллисек, значит искомы минуты - это целое от деления отатка миллискунд на это значение.
var minutes = Math.floor(temp/(1000 * 60));  // получили минуты, для данного примера, целое от деления 1 584 020 на 60 000 это 26 минут

// аналогично с часами нам нужно убрать уже выссчитанные минуты из нашей суммы миллисекунд
temp = temp % (1000 * 60); // % - даёт остаток от деления первого на второе
// обрати внимание, что тут уже берём temp и результат опять пишем в temp
// из предыдущего примера в temp у нас уже хранится 1 584 020, в одной минуте 60 000 миллисек, остаток от деления запишится в temp и будет равен 24 020 миллисек

// вычисляем секунды
var seconds  = Math.floor(temp/1000) // в одной минуте 1000 миллисек, следовательно ищем целое от деления на 1000

// вычисляем миллисекунды, это остаток от деления на 1000
var milliseconds = temp % 1000;

// осталовь вывести куда нужно полученные данные
alert(hours+" h "+minutes+" min "+seconds+" sec "+milliseconds+" mill");

